Repository: sphinxlogic/Microsoft-Windows-NT-Repository
Catalog: FREEWARE/v50/gnudiffutils/src/message/*.po
Languages: pl

source: %s %s differ: char %lu, line %lu is %3o %s %3o %s
pl: %s %s ró¿ni± siê: znak %lu, linia %lu zawiera %3o %s %3o %s

source: %s %s differ: char %lu, line %lu
pl: %s %s ró¿ni± sie: znak %lu, linia %lu

source: %s: diff failed:
pl: %s: diff nie zadzia³a³:

source: %s: illegal option -- %c
pl: %s: nielegalna opcja -- %c

source: %s: invalid option -- %c
pl: %s: b³êdna opcja -- %c

source: %s: option `%c%s' doesn't allow an argument
pl: %s: opcja `%c%s' nie mo¿e mieæ argumentu

source: %s: option `%s' is ambiguous
pl: %s: opcja `%s' is ambiguous

source: %s: option `%s' requires an argument
pl: %s: opcja `%s' wymaga argumentu

source: %s: option `--%s' doesn't allow an argument
pl: %s: opcja `--%s' nie mo¿e mieæ argumentu

source: %s: option requires an argument -- %c
pl: %s: opcja wymaga argumentu -- %c

source: %s: unrecognized option `--%s'
pl: %s: nierozpoznana opcja `--%s'

source: --GTYPE-group-format=GFMT Similar, but format GTYPE input groups with GFMT.
pl: --GTYPE-group-format=GFMT Podobne, ale u¿yj GFMT do sformatowania grup wej¶ciowych GTYPE

source: --LTYPE-line-format=LFMT Similar, but format LTYPE input lines with LFMT.
pl: --LTYPE-group-format=LFMT Podobne, ale u¿yj LFMT do sformatowania grup wej¶ciowych LTYPE

source: --binary Read and write data in binary mode.
pl: --binary Czytaj i zapisuj dane binarnie.

source: --help Output this help.
pl: --help Wypisz ten help.

source: --horizon-lines=NUM Keep NUM lines of the common prefix and suffix.
pl: --horizon-lines=ILE Zostaw ILE linii wspólnego przedrostka i przyrostka.

source: --ignore-initial value must be a nonnegative integer
pl: --ignore-initial - warto¶æ musi byæ dodatni± liczb± ca³kowit±

source: --line-format=LFMT Similar, but format all input lines with LFMT.
pl: --line-format=LFMT Podobne, ale u¿yj LFMT do sformatowania linii wej¶ciowych.

source: -3 --easy-only Output unmerged nonoverlapping changes.
pl: -3 --easy-only Wypisz niez³±czone nienachodz±ce zmiany

source: -A --show-all Output all changes, bracketing conflicts.
pl: -A --show-all Wypisz wszystkie zmiany, konflikty w nawiasach.

source: -B --ignore-blank-lines Ignore changes whose lines are all blank.
pl: -B --ignore-blank-lines Zignoruj zmiany w pustych liniach.

source: -D NAME --ifdef=NAME Output merged file to show `#ifdef NAME' diffs.
pl: -D NAZWA --ifdef=NAZWA Wypisz po³±czony plik dla pokazania ró¿nic w `#ifdef NAZWA'.

source: -D option not supported with directories
pl: -D opcja nie dzia³a dla katalogów

source: -E --show-overlap Output unmerged changes, bracketing conflicts.
pl: -E --show-overlap Wypisz niez³±czone zmiany, konflikty w nawiasach.

source: -H --speed-large-files Assume large files and many scattered small changes.
pl: -H --speed-large-files Spodziewaj siê du¿ych plików i rozrzuconych ma³ych zmian.

source: -I RE --ignore-matching-lines=RE Ignore changes whose lines all match RE.
pl: -I RE --ignore-matching-lines=RE Ignoruj zmiany gdy linie pasuj± do RE.

source: -L LABEL --label=LABEL Use LABEL instead of file name.
pl: -L ETYKIETA --label=ETYKIETA U¿yj ETYKIETA zamiast nazwy pliku.

source: -N --new-file Treat absent files as empty.
pl: -N --new-file Tkatuj brakuj±ce pliki jak puste.

source: -P --unidirectional-new-file Treat absent first files as empty.
pl: -P --unidirectional-new-file Traktuj brakuj±ce pierwsze pliki jak puste.

source: -S FILE --starting-file=FILE Start with FILE when comparing directories.
pl: -S PLIK --starting-file=PLIK Poruwnuj±c katalogi zacznij od PLIKu.

source: -T --initial-tab Make tabs line up by prepending a tab.
pl: -T --initial-tab Dodaj tab dla wyrównania linii z tabami.

source: -W --ignore-all-space Ignore all white space.
pl: -W --ignore-all-space Ignoruj wszystkie znaki odstêpu.

source: -X Output overlapping changes, bracketing them.
pl: -X Wypisz nachodz±ce zmiany w nawiasach.

source: -X FILE --exclude-from=FILE Exclude files that match any pattern in FILE.
pl: -X PLIK --exclude-from=PLIK Pomiñ pliki, które pasuj± do wzorca w PLIKu.

source: -a --text Treat all files as text.
pl: -a --text Traktuj pliki jak tekstowe.

source: -b --ignore-space-change Ignore changes in the amount of white space.
pl: -b --ignore-space-change Ignoruj zmiany ilosci znaków odstêpu.

source: -c --print-chars Output differing bytes as characters.
pl: -c --print-chars Wypisz ró¿ni±ce siê znaki znakowo.

source: -c -C NUM --context[=NUM] Output NUM (default 2) lines of copied context. -u -U NUM --unified[=NUM] Output NUM (default 2) lines of unified context. -NUM Use NUM context lines. -L LABEL --label LABEL Use LABEL instead of file name. -p --show-c-function Show which C function each change is in. -F RE --show-function-line=RE Show the most recent line matching RE.
pl: -c -C ILE --context[=ILE] Skopiuj ILE (domy¶lnie 2) linii kontekstu. -u -U ILE --unified[=ILE] ILE (domy¶lnie 2) linii zunifikowanego kontekstu. -ILE U¿yj ILE linii kontekstu. -L ETYKIETA --label ETYKIETA U¿yj ETYKIETA zamiast nazwy pilku. -p --show-c-function Wska¿ funkcje C, w których s± zmiany. -F RE --show-function-line=RE Poka¿ ostatni± linie pasuj±c± do RE.

source: -d --minimal Try hard to find a smaller set of changes.
pl: -d --minimal Staraj siê mocno znale¼æ mniejszy zbiór zmian.

source: -e --ed Output an ed script.
pl: -e --ed Wypisz jako komendy ed-a

source: -e --ed Output unmerged changes from OLDFILE to YOURFILE into MYFILE.
pl: -e --ed Wypisz niez³±czone zmiany miêdzy STARY_PLIK a NOWY_PLIK do MÓJ_PLIK.

source: -i --ignore-case Consider upper- and lower-case to be the same.
pl: -i --ignore-case Traktuj ma³e i du¿e litery tak samo.

source: -i Append `w' and `q' commands to ed scripts.
pl: -i Dodaj komendy `w' i `q' do komend ed-a.

source: -i N --ignore-initial=N Ignore differences in the first N bytes of input.
pl: -i N --ingnore-initial=N Ignoruj ró¿nice w pierwszych N bajtach danych.

source: -l --left-column Output only the left column of common lines.
pl: -I --left-column Wypisz tylko lew± kolumnê dla wspólnych linii.

source: -l --paginate Pass the output through `pr' to paginate it.
pl: -I --paginate Przepu¶æ wynik przez `pr' ¿eby go stronnicowaæ.

source: -l --verbose Output offsets and codes of all differing bytes.
pl: -I --verbose Wypisz po³o¿enia i kody wszystkich ró¿ni±cych siê bajtów.

source: -m --merge Output merged file instead of ed script (default -A).
pl: -m -merge Wypisz po³±czony plik zamiast komend ed-a (domy¶lnie -A).

source: -n --rcs Output an RCS format diff.
pl: -n --rcs Wypisz ró¿nice w formacie RCS.

source: -o FILE --output=FILE Operate interactively, sending output to FILE.
pl: -o PLIK --output=PLIK Dzia³aj interakcyjnie, wyniki ¶lij do PLIKu.

source: -q --brief Output only whether files differ.
pl: -q --brief Wypisz wynik tylko gdy pliki siê ró¿ni±.

source: -r --recursive Recursively compare any subdirectories found.
pl: -r --rcursive Porównuj rekurencyjnie podkatalogi.

source: -s --quiet --silent Output nothing; yield exit status only.
pl: -s --quiet --silnet Nie wypisuj nic; przeka¿ tylko status

source: -s --report-identical-files Report when two files are the same.
pl: -s --report-identical-files Informuj gdy dwa pliki s± takie same.

source: -s --suppress-common-lines Do not output common lines.
pl: -s --suppress-common-lines Nie wypisuj wspólnych linii.

source: -t --expand-tabs Expand tabs to spaces in output.
pl: -t --expand-tabs W wynikach rozwiñ taby w spacje.

source: -v --version Output version info.
pl: -v --version Wypisz informacjê o wersji.

source: -w --ignore-all-space Ignore all white space.
pl: -w --ignore-all-space Ignoruj znaki odstêpu.

source: -w NUM --width=NUM Output at most NUM (default 130) characters per line.
pl: -w ILE --width=ILE Wypisz najwy¿ej ILE (domy¶nie 130) znaków w linii.

source: -x --overlap-only Output overlapping changes.
pl: -x --overlap-only Wypisz nachodz±ce zmiany.

source: -x PAT --exclude=PAT Exclude files that match PAT.
pl: -x WZÓR --exclude=WZÓR Wyklucz pliki pasuj±ce do WZORu.

source: -y --side-by-side Output in two columns. -w NUM --width=NUM Output at most NUM (default 130) characters per line. --left-column Output only the left column of common lines. --suppress-common-lines Do not output common lines.
pl: -y --side-by-side Wypisz wynik w dwóch kolumnach. -w ILE --width=ILE Wypisz najwy¿ej ILE (domy¶nie 130) znaków w linii. --left-column Wypisz tylko lew± kolumnê dla wspólnych linii. --suppress-common-lines Nie wypisuj wspólnych linii.

source: : not found
pl: : nie znaleziono

source: Binary files %s and %s differ
pl: Pliki binarne %s i %s maj± ró¿nice

source: Common subdirectories: %s and %s
pl: Wspólne podkatalogi: %s i %s

source: Either GFMT or LFMT may contain: %% % %c'C' the single character C %c'\OOO' the character with octal code OOO
pl: GFMT albo LFMT mog± zawieraæ: %% % %c'C' pojedyñczy znak C %c'\OOO' znak o kodzie ósemkowym OOO

source: File %s is a %s while file %s is a %s
pl: Plik %s jest %s, podczas gdy plik %s jest %s

source: Files %s and %s are identical
pl: Pliki %s i %s s± identyczne

source: Files %s and %s differ
pl: Pliki %s i %s ró¿ni± siê

source: GFMT may contain: %< lines from FILE1 %> lines from FILE2 %= lines common to FILE1 and FILE2 %[-][WIDTH][.[PREC]]{doxX}LETTER printf-style spec for LETTER LETTERs are as follows for new group, lower case for old group: F first line number L last line number N number of lines = L-F+1 E F-1 M L+1
pl: GFMT mo¿e zawieraæ: %< linie z PLIKU1 %> linie PLIKU2 %= linie wsólne dla PLIKU1 i PLIKU2 %[-][SZER][.[DOK£]]{doxX}LITERA specyfikacja w stylu printf dla LITERY LITERY s± nastêpuj±ce dla nowej grupy, ma³e dla starej grupy: F numer pierwszej linii L numer ostatniej linii N ilo¶æ linii = L-F+1 E F-1 M L+1

source: If a FILE is `-' or missing, read standard input.
pl: Je¿eli PLIK to `-' lub go brak, czytaj standardowe wej¶cie.

source: If a FILE is `-', read standard input.
pl: Je¿eli PLIK to `-', czytaj standardowe wej¶cie.

source: Invalid back reference
pl: Z³y odno¶nik wstecz

source: Invalid character class name
pl: Z³a nazwa klasy znaków

source: Invalid collation character
pl: Zly znak zbiorczy

source: Invalid content of \{\}
pl: Z³a zawarto¶æ \{\}

source: Invalid preceding regular expression
pl: Z³e poprzedzj±ce wyra¿enie regularne

source: Invalid range end
pl: Z³y koniec zakresu

source: Invalid regular expression
pl: Z³e wyra¿enie regularne

source: LFMT may contain: %L contents of line %l contents of line, excluding any trailing newline %[-][WIDTH][.[PREC]]{doxX}n printf-style spec for input line number
pl: LFMT mo¿e zawieraæ: %L zawarto¶æ linii %l zawarto¶c linii, wy³aczaj±c znak nowej linii %[-][SZER][.[DOK£]]{doxX}n specyfikacja numeru linii w stylu printf

source: LTYPE is `old', `new', or `unchanged'. GTYPE is LTYPE or `changed'.
pl: LTYPE jest `old', `news' lub `unchanged'. GTYPE jest LTYPE lub `changed'.

source: Memory exhausted
pl: Brak pamiêci

source: No match
pl: Nie pasuje

source: No newline at end of file
pl: Brak znaku nowej linii na koñcu pliku

source: No previous regular expression
pl: Brak porzedniego wyra¿enia regularnego

source: Only in %s: %s
pl: Tylko w %s: %s

source: Premature end of regular expression
pl: Przedwczesny koniec wyra¿enia regularnego

source: Regular expression too big
pl: Wyra¿enia regularne jest za du¿e

source: Success
pl: Powodzenie

source: Trailing backslash
pl: Koñcowy uko¶nik odwrotny

source: Try `%s --help' for more information.
pl: Spróbuj `%s --help' dla otrzymania informacji.

source: Unmatched ( or \(
pl: Nie sparowany ( lub \(

source: Unmatched ) or \)
pl: Nie sparowany ) lub \)

source: Unmatched [ or [^
pl: Nie sparowany [ lub [^

source: Unmatched \{
pl: Nie sparowany \{

source: Usage: %s [OPTION]... FILE1 FILE2
pl: U¿ycie: %s [OPCJA]... PLIK1 PLIK2

source: Usage: %s [OPTION]... FILE1 [FILE2]
pl: U¿ycie: %s [OPCJA]... PLIK1 [PLIK2]

source: Usage: %s [OPTION]... MYFILE OLDFILE YOURFILE
pl: U¿ycie: %s [OPCJA]... MÓJ_PLIK STARY_PLIK TWÓJ_PLIK

source: `-' specified for more than one input file
pl: `-' podany dla wiêcej ni¿ jednego pliku wej¶ciowego

source: block special file
pl: specjalny plik blokowy

source: both files to be compared are directories
pl: oba maj±ce byæ porównane pliki to katalogi

source: cannot compare `-' to a directory
pl: nie mogê porównaæ `-' z katalogiem

source: cannot interactively merge standard input
pl: nie mogê interakcyjnie ³±czyæ standardowego wej¶cia

source: character special file
pl: specjalny plik znakowy

source: cmp: EOF on %s
pl: cmp: EOF przy %s

source: column width must be a positive integer
pl: kolumna musi byæ dodatni± liczb± ca³kowit±

source: conflicting #ifdef format
pl: niezgodny format #ifdef

source: conflicting group format
pl: niezgodny format grupy

source: conflicting line format
pl: niezgodny format linii

source: conflicting specifications of output style
pl: niezgodne specyfikacje stylu wyniku

source: context length must be a nonnegative integer
pl: wielko¶æ kontekstu musi byæ nieujemn± liczb± ca³kowit±

source: context length specified twice
pl: wielko¶æ kontekstu podana dwukrotnie

source: directory
pl: katalog

source: extra operand
pl: nadmiarowy argument

source: horizon must be a nonnegative integer
pl: horyzont musi byæ nieujemn± liczb± ca³kowit±

source: incompatible options
pl: niezgodne opcje

source: input file shrank
pl: plik wej¶ciowy siê zmiejszy³

source: internal error: invalid diff type in process_diff
pl: b³±d wewnêtrzny: z³y typ diff w process_diff

source: internal error: invalid diff type passed to output
pl: b³±d wenwêtrzny: z³y diff przekazany do wyj¶cia

source: internal error: screwup in format of diff blocks
pl: b³ad wewnêtrzny: spieprzony format bloków diff

source: invalid diff format; incomplete last line
pl: z³y format diff; niekompletna ostatnia linia

source: invalid diff format; incorrect leading line chars
pl: z³y format diff; nieprawid³owe znaki na pocz±tku linii

source: invalid diff format; invalid change separator
pl: z³y format diff; z³y separator zmian

source: l: Use the left version. r: Use the right version. e l: Edit then use the left version. e r: Edit then use the right version. e b: Edit then use the left and right versions concatenated. e: Edit a new version. s: Silently include common lines. v: Verbosely include common lines. q: Quit.
pl: l: iU¿yj wersji po lewej. r: U¿yj wersji po prawej. e l: Edytuj i u¿yj wrsji po lewej. e r: Edytuj i u¿yj wersji po prawej. e b: Edytuj i u¿yj po³±czoynch wersji z lewej i prawej. e: Edytuj now± wersjê. s: W³±cz wspólne linie nie mówi±c o tym. v: W³±cz wspólne linie mówi±c o tym. q: Zakoñcz.

source: message queue
pl: kolejka komunikatów

source: missing operand
pl: brakuj±cy argument

source: read failed
pl: odczyt nieudany

source: regular empty file
pl: zwyk³y pusty plik

source: regular file
pl: zwyk³y plik

source: semaphore
pl: semafor

source: shared memory object
pl: obiekt w pamiêci dzielonej

source: socket
pl: gniazdo

source: subsidiary program failed
pl: program pomocniczy ¼le zadzia³a³

source: too many file label options
pl: za du¿o opcji etykietowania plików

source: weird file
pl: dziwny plik

source: write failed
pl: zapis nieudany
