!*******************************************************************************
!
!  Reserved symbols for PP - the Pascal program text pre-processor.
!
!  Format of this file:
!    - symbols are STRICTLY ONE to a line;
!    - symbols have a maximum length of 31 characters;
!    - symbols are STRICTLY in ASCENDING ASCII order;
!    - Comments may appear on a line starting with an exclamation mark.
!
!-------------------------------------------------------------------------------
!
!  Author:  Jonathan Ridler,
!	    Information Technology Services,				
!	    The University of Melbourne.				
!									
!  Email:   jonathan@unimelb.edu.au					
!...............................................................................
!									
!  History:								
!	21-Oct-1987	JER	Original version.
!*******************************************************************************
!
ABS
ACCESS_METHOD
ADDRESS
ADD_INTERLOCKED
ALIGNED
AND
AND_THEN
ARCTAN
ARGUMENT
ARGUMENT_LIST_LENGTH
ARRAY
ASYNCHRONOUS
AUTOMATIC
BEGIN
BIN
BIT
BITNEXT
BITSIZE
BIT_OFFSET
BODY
BOOLEAN
BYTE
BYTE_OFFSET
CARD
CASE
CHAR
CHR
CLASS_A
CLASS_NCA
CLASS_S
CLEAR_INTERLOCKED
CLOCK
CLOSE
CONST
CONTINUE
COS
CREATE_DIRECTORY
DATE
DBLE
DEC
DELETE
DELETE_FILE
DESCR
DISPOSE
DISPOSITION
DIV
DO
DOUBLE
DOWNTO
ELSE
END
ENVIRONMENT
EOF
EOLN
EQ
ESTABLISH
EXP
EXPO
EXTEND
EXTERN
EXTERNAL
FALSE
FILE
FILE_NAME
FIND
FINDK
FIND_FIRST_BIT_CLEAR
FIND_FIRST_BIT_SET
FIND_MEMBER
FIND_NONMEMBER
FOR
FORTRAN
FORWARD
FUNCTION
GE
GET
GETTIMESTAMP
GLOBAL
GOTO
GT
G_FLOATING
HALT
HEX
HIDDEN
HISTORY
IADDRESS
IDENT
IF
IMMED
IMMEDIATE
IN
INCLUDE
INDEX
INHERIT
INPUT
INT
INTEGER
KEYED
LABEL
LE
LENGTH
LINELIMIT
LIST
LN
LOCAL
LOCATE
LONG
LOWER
LT
MAX
MAXCHAR
MAXINT
MAXUNSIGNED
MFPR
MIN
MOD
MODULE
MTPR
NE
NEW
NEXT
NIL
NOG_FLOATING
NOOPTIMIZE
NOT
OCT
OCTA
ODD
OF
OPEN
OPTIMIZE
OR
ORD
OR_ELSE
OTHERWISE
OUTPUT
OVERLAID
PACK
PACKED
PAD
PAGE
POS
PRED
PRESENT
PROCEDURE
PROGRAM
PSECT
PUT
QUAD
QUADRUPLE
READ
READLN
READONLY
READV
READWRITE
REAL
RECORD
REF
REFERENCE
REM
RENAME_FILE
REPEAT
RESET
RESETK
REVERT
REWRITE
ROUND
SET
SET_INTERLOCKED
SHARING
SIN
SINGLE
SIZE
SNGL
SQR
SQRT
STATIC
STATUS
STATUSV
STDESCR
STRING
SUBSTR
SUCC
TEXT
THEN
TIME
TIMESTAMP
TO
TRUE
TRUNC
TRUNCATE
TYPE
UAND
UDEC
UFB
UINT
UNALIGNED
UNBOUND
UNDEFINED
UNLOCK
UNOT
UNPACK
UNSAFE
UNSIGNED
UNTIL
UOR
UPDATE
UPPER
UROUND
USER_ACTION
UTRUNC
UXOR
VALUE
VAR
VARYING
VOLATILE
WEAK_EXTERNAL
WEAK_GLOBAL
WHILE
WITH
WORD
WRITE
WRITELN
WRITEONLY
WRITEV
XOR
ZERO
!
!**************  E N D   O F   R E S E R V E D   S Y M B O L S  **************
