IDENTIFICATION DIVISION.
PROGRAM-ID. prog1.
*
*  Starts a program image
*
PROCEDURE DIVISION.
MAINLINE SECTION.
START-UP.

	STOP RUN.

START-UP-EXIT.
	EXIT.
