IDENTIFICATION DIVISION.
PROGRAM-ID. prog4.
*
* displays numbers across a line up to 1000 numbers
*
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.

01 WS-CNT                        PIC 9(5)  VALUE 1.

PROCEDURE DIVISION.

MAINLINE SECTION.
START-UP.

	PERFORM 1-DISPLAY VARYING WS-CNT FROM 1 BY 1
	   UNTIL WS-CNT > 1000.
	STOP RUN.

START-UP-EXIT.
	EXIT.

1-DISPLAY.
	
	
 	DISPLAY WS-CNT with conversion no advancing.

1-EXIT.
	EXIT.
