IDENTIFICATION DIVISION.
PROGRAM-ID. prog2.
*
*  opens and closes a file
*
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.

        SELECT TEST-FILE
                ASSIGN TO "SYS$SCRATCH:TTI_VENDOR.TMP"
                ORGANIZATION IS SEQUENTIAL.


DATA DIVISION.
FILE SECTION.

FD  TEST-FILE.
01  TEST-FILE-RECORD.
    05 NAME        PIC X(30).
    05 SEX         PIC X.
    05 B-DATE      PIC X(6).
    05 STREET      PIC X(30).
    05 CITY        PIC X(12).
    05 ZIP         PIC X(9).
    05 ETHNIC      PIC X.
    05 PARENT      PIC X(24).
    05 PHONE       PIC X(10).
    05 BPHONE      PIC X(10).
    05 EPHONE      PIC X(10).
    05 BALANCE     PIC 9(8).
    05 FILLER      PIC X(49).


PROCEDURE DIVISION.

MAINLINE SECTION.
START-UP.

	OPEN INPUT TEST-FILE ALLOWING ALL.
	CLOSE TEST-FILE.
	STOP RUN.

START-UP-EXIT.
	EXIT.
